In [1]:
# Import libraries
import mysql.connector 
import pandas as pd

In [2]:
# Create connection
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = '101014sd',
    database = 'sakila'
)

In [8]:
# Soal 1
mycursor = mydb.cursor()

query = 'SELECT f.title, c.name AS category, f.length FROM category AS c INNER JOIN film_category AS fc USING (category_id) INNER JOIN film AS f USING (film_id) WHERE name="Comedy" ORDER BY (length) asc LIMIT 10'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

              title category  length
0   DOWNHILL ENOUGH   Comedy      47
1  PARADISE SABRINA   Comedy      48
2    HEAVEN FREEDOM   Comedy      48
3  HURRICANE AFFAIR   Comedy      49
4        LION UNCUT   Comedy      50
5         ZORRO ARK   Comedy      50
6       CLOSER BANG   Comedy      58
7   AIRPLANE SIERRA   Comedy      62
8   LONELY ELEPHANT   Comedy      67
9      DOOM DANCING   Comedy      68

In [15]:
# Soal 2
mycursor = mydb.cursor()

query = 'SELECT c.name AS category, COUNT(fc.category_id) AS jumlahMovie , AVG(f.rental_rate) AS rataHargaSewa FROM category AS c INNER JOIN film_category AS fc USING (category_id) INNER JOIN film AS f USING (film_id) GROUP BY (category) ORDER BY (jumlahMovie) desc'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

       category  jumlahMovie rataHargaSewa
0        Sports           74      3.125135
1       Foreign           73      3.099589
2        Family           69      2.758116
3   Documentary           68      2.666471
4     Animation           66      2.808182
5        Action           64      2.646250
6           New           63      3.116984
7         Drama           62      3.022258
8         Games           61      3.252295
9        Sci-Fi           61      3.219508
10     Children           60      2.890000
11       Comedy           58      3.162414
12     Classics           57      2.744386
13       Travel           57      3.235614
14       Horror           56      3.025714
15        Music           51      2.950784

In [17]:
# Soal 3
mycursor = mydb.cursor()

query = 'SELECT a.actor_id, a.first_name, a.last_name, COUNT(fa.film_id) AS jumlah_Movie FROM actor AS a INNER JOIN film_actor AS fa USING (actor_id) GROUP BY (actor_id) ORDER BY (jumlah_Movie) desc LIMIT 10'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

   actor_id first_name  last_name  jumlah_Movie
0       107       GINA  DEGENERES            42
1       102     WALTER       TORN            41
2       198       MARY     KEITEL            40
3       181    MATTHEW     CARREY            39
4        23     SANDRA     KILMER            37
5        81   SCARLETT      DAMON            36
6        37        VAL     BOLGER            35
7       158     VIVIEN   BASINGER            35
8       106    GROUCHO      DUNST            35
9        13        UMA       WOOD            35

In [24]:
# Soal 4
mycursor = mydb.cursor()

query = 'SELECT c.name AS category, COUNT(fa.film_id) AS jumlah_Movie FROM category as c INNER JOIN film_category AS fc USING (category_id) INNER JOIN film_actor AS fa USING (film_id) INNER JOIN actor AS a USING (actor_id) WHERE actor_id=107 GROUP BY (category)'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

       category  jumlah_Movie
0   Documentary             3
1       Foreign             2
2         Music             4
3           New             1
4        Sci-Fi             7
5        Action             3
6         Drama             2
7     Animation             4
8        Horror             1
9        Family             4
10       Comedy             3
11     Children             2
12     Classics             2
13       Sports             2
14        Games             1
15       Travel             1

In [26]:
# Soal 5
mycursor = mydb.cursor()

query = 'SELECT fl.title, fl.category FROM film_list as fl INNER JOIN film_actor AS fa ON fl.FID = fa.film_id INNER JOIN actor AS a USING (actor_id) WHERE actor_id=107 and category="Sci-Fi"'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

                 title category
0  CHARIOTS CONSPIRACY   Sci-Fi
1  COLDBLOODED DARLING   Sci-Fi
2       FRISCO FORREST   Sci-Fi
3    GOODFELLAS SALUTE   Sci-Fi
4      LICENSE WEEKEND   Sci-Fi
5         OPEN AFRICAN   Sci-Fi
6  SPIRITED CASUALTIES   Sci-Fi